---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.Documents
source: html/8a32ffe0-7e80-e85c-78aa-1af48ace4d74.htm
---
# Autodesk.Revit.ApplicationServices.Application.Documents Property

Returns a set of documents within Revit.

## Syntax (C#)
```csharp
public virtual DocumentSet Documents { get; }
```

## Remarks
This property can be used for the user to find all the document inside Revit.